Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70b/edc/ATSAME70Q19B.PIC
      <edc:AdjustPoint edc:_addr="0x4003C078" edc:offset="0x1C"/>
      <edc:SFRDef edc:_addr="0x4003C094" edc:access="----------------------nn----nn--" edc:cname="AFEC0_ACR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="PGA0EN" edc:desc="PGA0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PGA1EN" edc:desc="PGA1 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="IBCTL" edc:desc="AFE Bias Current Control" edc:nzwidth="0x2"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C098" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4003C0A0" edc:access="--------------------nnnnnnnnnnnn" edc:cname="AFEC0_SHMR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DUAL0" edc:desc="Dual Sample &amp; Hold for channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL1" edc:desc="Dual Sample &amp; Hold for channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL2" edc:desc="Dual Sample &amp; Hold for channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL3" edc:desc="Dual Sample &amp; Hold for channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL4" edc:desc="Dual Sample &amp; Hold for channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL5" edc:desc="Dual Sample &amp; Hold for channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL6" edc:desc="Dual Sample &amp; Hold for channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL7" edc:desc="Dual Sample &amp; Hold for channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL8" edc:desc="Dual Sample &amp; Hold for channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL9" edc:desc="Dual Sample &amp; Hold for channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL10" edc:desc="Dual Sample &amp; Hold for channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DUAL11" edc:desc="Dual Sample &amp; Hold for channel 11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C0A4" edc:offset="0x2C"/>
      <edc:SFRDef edc:_addr="0x4003C0D0" edc:access="-------------------------------n" edc:cname="AFEC0_COSR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CSEL" edc:desc="Sample &amp; Hold unit Correction Select" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C0D4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="AFEC0_CVR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:desc="Offset Correction" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:desc="Gain Correction" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C0D8" edc:access="--------------------nnnnnnnnnnnn" edc:cname="AFEC0_CECR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ECORR0" edc:desc="Error Correction Enable for channel 0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR1" edc:desc="Error Correction Enable for channel 1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR2" edc:desc="Error Correction Enable for channel 2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR3" edc:desc="Error Correction Enable for channel 3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR4" edc:desc="Error Correction Enable for channel 4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR5" edc:desc="Error Correction Enable for channel 5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR6" edc:desc="Error Correction Enable for channel 6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR7" edc:desc="Error Correction Enable for channel 7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR8" edc:desc="Error Correction Enable for channel 8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR9" edc:desc="Error Correction Enable for channel 9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR10" edc:desc="Error Correction Enable for channel 10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ECORR11" edc:desc="Error Correction Enable for channel 11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C0DC" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0x4003C0E4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnn-------n" edc:cname="AFEC0_WPMR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPEN" edc:desc="Write Protection Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPKEY" edc:desc="Write Protect KEY" edc:nzwidth="0x18">
              <edc:SFRFieldSemantic edc:cname="PASSWD" edc:desc="Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0." edc:when="(field &amp; 0xFFFFFF) == 0x414443"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4003C0E8" edc:access="--------rrrrrrrrrrrrrrrr-------r" edc:cname="AFEC0_WPSR" edc:nzwidth="0x20" ltx:memberofperipheral="AFEC0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="WPVS" edc:desc="Write Protect Violation Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="WPVSRC" edc:desc="Write Protect Violation Source" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4003C0EC" edc:offset="0x3F14"/>
      <edc:SFRDef edc:_addr="0x40040000" edc:access="-------------------------------w" edc:cname="DACC_CR" edc:nzwidth="0x20" ltx:memberofperipheral="DACC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
